app/controllers/lists_controller.rb

INSERT INTO "lists" ("name", "plan_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "test"], ["plan_id", 1], ["created_at", "2020-01-13 05:54:24.134331"], ["updated_at", "2020-01-13 05:54:24.134331"]]
---
    def create
        @list = List.create(allowed_params)

DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 5]]
---
    def destroy
        @list.delete

SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def find_list
        @list = List.find(params[:id])