app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("name", "priority", "list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "test"], ["priority", "High"], ["list_id", 1], ["created_at", "2020-01-13 05:48:36.336987"], ["updated_at", "2020-01-13 05:48:36.336987"]]
---
    def create
        @task = Task.create(allowed_params)

UPDATE "tasks" SET "name" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["name", "Create FE for edit-a-lis"], ["updated_at", "2020-01-13 06:19:17.773273"], ["id", 26]]
---
    def update
        @task.update(allowed_params)

DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 15]]
---
    def destroy
        @task.delete

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_task
        @task = Task.find(params[:id])