app/controllers/users_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?)
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES (?, ?, ?)  [["username", "tatismolin"], ["created_at", "2019-12-30 02:03:27.847275"], ["updated_at", "2019-12-30 02:03:27.847275"]]
---
    def create
        @user = User.create(allowed_params)
        if @user.save